# Измените код одной-двух решенных ранее задач (с прошлых семинаров или домашних работ),
# применив лямбды, filter, map, zip, enumerate, списочные выражения.

# Дан список. Выведите те его элементы, которые встречаются в списке только один раз.
# Элементы нужно выводить в том порядке, в котором они встречаются в списке.

sp = [1, 2, 2, 3, 3, 3, 4]
print(list(filter(lambda x: sp.count(x) == 1,sp)))
