# 5.	Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:	для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

num = int(input('Введите число: '))
f0 = 0
f1 = 1
sp = [0, 1]
for i in range(num - 1):
    fn = f0 + f1
    sp.append(fn)
    f0 = f1
    f1 = fn

f0 = 0
f1 = 1
sp2 = [1]
for i in range(num - 1):
    fn = f0 - f1
    sp2.append(fn)
    f0 = f1
    f1 = fn
sp2.reverse()
print(sp2 + sp)
